{
  "selectedTemplate": 1,
  "headings": {
    "work": "Work Experience",
    "education": "Education",
    "skills": "Skills",
    "projects": "Presentations"
  },
  "basics": {
    "name": "Neal Kaviratna",
    "email": "kaviratnaneal@gmail.com",
    "phone": "9122281121",
    "location": {
      "address": "Pittsburgh, PA"
    },
    "website": "https://www.linkedin.com/in/nealkaviratna/"
  },
  "education": [
    {
      "institution": "Georgia Institute of Technology",
      "area": "Computer Science",
      "endDate": "Present",
      "location": "Atlanta, GA (Online)",
      "studyType": "Online MS",
      "startDate": "Jan 2020"
    },
    {
      "institution": "Georgia Institute of Technology",
      "location": "Atlanta, GA",
      "studyType": "BS",
      "area": "Computer Science",
      "endDate": "Dec 2016",
      "startDate": "Sep 2012"
    }
  ],
  "work": [
    {
      "company": "Uber ATG",
      "location": "Pittsburgh, PA",
      "website": "",
      "endDate": "December 2020",
      "highlights": [
        "Led technical effort to make self driving simulator adaptable for large scale autonomy-software changes (fundamental restructuring of the robot stack). Architected and implemented solution for 100s of autonomy engineers to test and land new system while building consensus across Autonomy, Systems Engineering, and Safety groups on cleanly transitioning to the new simulation modality.",
        "Key Contributor to Simulation Engine for testing autonomous vehicles. Contributions include: Camera Simulation and Auto-labeling, Automated Scenario Generation from real world data, Actor Trajectory Editor and associated movement code, and Software Bridge for interfacing with 2 robotic operating systems.",
        "Acting Manager for 6+ person engineering team for 11 weeks (manager on leave). Succesfully supported team through group reorganization. Helped team remain performant through continued fully remote time period. Managed Quarterly planning for group.",
        "Tech Lead on team providing reliable software solutions that scale to hundreds of thousands of sensor simulations, allowing deep exploration of autonomy behavior across multiple dimensions of scenario parameters (eg: actor position, speed etc.) Managed Sprint to Sprint planning and execution of multiple engineers.",
        "Positive Culture contributions - Co-hosted Diversity and Inclusion chat with Director for Simulation organization, organized team building activities, and helped drive positive team culture."
      ],
      "position": "Software Engineer - Senior Software Engineer",
      "startDate": "February 2017"
    },
    {
      "highlights": [
        "Implemented code for various aspects of Unity 3D Game Project. Added features based on Crystal Fish Games (CFG) requests into a large pre-existing codebase.",
        "Collaborated closely with the CFG team to ensure quality game design and mechanics."
      ],
      "company": "Crystal Fish Games",
      "position": "Contracted Software Engineer",
      "location": "Atlanta, GA",
      "startDate": "October 2015",
      "endDate": "May 2016"
    },
    {
      "highlights": [
        "Worked with producers and developers to ensure games launch bug-free.",
        "Facilitated launch of several mobile titles as lead member of Quality Assurance department."
      ],
      "company": "Cartoon Network Digital",
      "position": "Quality Assurance Coop",
      "startDate": "Aug. 2014",
      "endDate": "May 2016",
      "location": "Atlanta, GA"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "C++ proficient",
        "Python proficient",
        "Unreal Engine 4",
        "Unity Game Engine",
        "Git"
      ],
      "name": "Technologies"
    },
    {
      "keywords": [
        "Communication",
        "Meeting Management",
        "Team leadership",
        "Agile/SaFe methodologies"
      ],
      "name": "Soft skills"
    },
    {
      "keywords": [
        "Chess",
        "Super Smash Brothers",
        "Travel (ask me about my camper trailer)",
        "Cooking"
      ],
      "name": "Hobbies"
    }
  ],
  "projects": [
    {
      "keywords": [
        null
      ],
      "description": "\"Testing Self Driving Cars with Game Development Tools\". Talk on building a game engine based simulator at ATG and lessons learned. See link for abstract in conference proceedings.",
      "url": "dl.acm.org/doi/10.1145/3388767.3408334",
      "name": "Siggraph 2020 Tech Talk"
    },
    {
      "keywords": [
        ""
      ],
      "name": "Siggraph Spotlight Podcast Feature",
      "description": "Additionally featured in Siggraph Spotlight podcast episode 29 \"Game On\" alongside 3 others presenting at the conference. Podcast discusses innovative applications for games technology beyond entertainment. See link for podcast episode on Spotify.",
      "url": "https://sptfy.com/nkaviratna_siggraph"
    }
  ],
  "awards": [
    {
      "title": "",
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "projects",
    "skills",
    "education",
    "awards"
  ]
}